Revit 2027 API
TextNode.WidthScale Property
 Scale applied to the width of the text.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double WidthScale { get; }
Public ReadOnly Property WidthScale As Double
	Get
public:
property double WidthScale {
	double get ();
}
member WidthScale : float with get
Property Value
Double
See Also
Reference
TextNode Class
Autodesk.Revit.DB Namespace